# Data manipulation using Pandas
### Workshop 1
*Jun 27 - IACS-MACI Internship*

**Pandas** is a python library containing tools for data manipulation. It extends from `numpy` as it deal with operations on multidimensional array.

The main class of Pandas is `DataFrame` which is similar to tables in Excel. In other words, **Pandas allow us to work with tabular data in python**.

<img src="images/pandas_excel.jpeg" width="300"/>

Data scientist use Pandas a lot! This library provides **high-level functions** that **acelerate** the **analysis** and **preprocessing** of our data.

## The DataFrame class
The [`DataFrame`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html#pandas.DataFrame) class contains all you need to reproduce/create an excel table.
<img src="images/dataframe_excel.png" width="900"/>

Lets create a `DataFrame` instance from scratch.

First we need to import Pandas library. 

To install pandas use: `pip install pandas` or `conda install pandas`

In [2]:
import pandas as pd # conventionally we rename pandas as 'pd'

In [2]:
data = [
    [1, 'a', .1],
    [2, 'b', .2],
    [3, 'c', .3],
    [4, 'd', .4],
    [5, 'e', .5],
    [6, 'd', .6]
]
indices = [2,3,4,5,6,7]

columns = ['col1', 'col2', 'col3']

In [3]:
df = pd.DataFrame(data=data, index=indices, columns=columns)

In [4]:
df

   col1 col2  col3
2     1    a   0.1
3     2    b   0.2
4     3    c   0.3
5     4    d   0.4
6     5    e   0.5
7     6    d   0.6

Once the DataFrame is created we can operate over it using `pandas` functions

### Having already an excel file?

Most of the time, we recieve tabular data already stored in a file. 

In this case, we can load tables from different formats such as xlsx, csv, sql, etc,... 

Some formats (like the `xlsx`) requires special modulest to work. In the worst case, python displays an error indicating the name of the module. Then you only have to install it.

<img src="images/error_xlsx.png" width="700"/>

In [5]:
df = pd.read_excel('./data/example_1.xlsx')

In [6]:
df

   col1 col2  col3
0   1.0    a   0.1
1   2.0    b   0.2
2   3.0    c   0.3
3   4.0    d   0.4
4   5.0    e   0.5
5   6.0    d   0.6

Notice that the indices and the columns formats are not the same. Since we are working with a `DataFrame` object we can modify everything without changing the `xlsx` file

In [7]:
df.index = [2, 3, 4, 5, 6, 7] # Changing a class parameter

In [8]:
df

   col1 col2  col3
2   1.0    a   0.1
3   2.0    b   0.2
4   3.0    c   0.3
5   4.0    d   0.4
6   5.0    e   0.5
7   6.0    d   0.6

In order to change the column format we have to use the `astype()` function from the [`Series`](https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series) class. 

Thus, every column in a `DataFrame` is a `Series` object,

In [9]:
type(df), type(df['col1'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

The `Series` object has functions that operates over the column data. 

In the example, we need to change the format of the `col1` from floats to integers.

In [10]:
df['col1'] = df['col1'].astype(int)

In [11]:
df

   col1 col2  col3
2     1    a   0.1
3     2    b   0.2
4     3    c   0.3
5     4    d   0.4
6     5    e   0.5
7     6    d   0.6

of course we can also save the `DataFrame` in the desire format

In [12]:
df.to_csv('./data/example_1.csv', index=False) # Put index=false to avoid creating a new index column

In [13]:
pd.read_csv('./data/example_1.csv')

   col1 col2  col3
0     1    a   0.1
1     2    b   0.2
2     3    c   0.3
3     4    d   0.4
4     5    e   0.5
5     6    d   0.6

Finally, Pandas can also load data from remote sources (`url`). For example, the science ministry of Chile has climate change resources for investigation. In this case, we use [the amount of water falling in 24 hours](https://github.com/MinCiencia/Datos-CambioClimatico/tree/main/output/agua24_dmc).

In this case the link is 

`https://github.com/MinCiencia/Datos-CambioClimatico/blob/main/output/agua24_dmc/1955/1955_agua24_dmc.csv`

which display a visualization of the tabular data. However, in order to load the csv in a `DataFrame` we must access to the raw format


<img src="images/raw_csv.png" width="900"/>

In [14]:
pd.read_csv('https://raw.githubusercontent.com/MinCiencia/Datos-CambioClimatico/main/output/agua24_dmc/1955/1955_agua24_dmc.csv')

,time,latitud,longitud,RRR24_Valor,Traza_Valor,CodigoNacional,nombreEstacion
0,1955-08-11 12:00:00,-45.91833,-71.67778,2.0,0.0,450005.0,Balmaceda Ad.

## Pandas operations

### Concatenation

When we concatenate we **connect**, as in chain, **two or more** `DataFrame` that have the **same structure**.

Let's take the github repository used in the previous exercise to show how concatenation works in Pandas

In [15]:
template_url = 'https://raw.githubusercontent.com/MinCiencia/Datos-CambioClimatico/main/output/agua24_dmc/{}/{}_agua24_dmc.csv'

In [16]:
year = 1994
template_url.format(year, year)

'https://raw.githubusercontent.com/MinCiencia/Datos-CambioClimatico/main/output/agua24_dmc/1994/1994_agua24_dmc.csv'

In [17]:
pd.read_csv(template_url.format(year, year))

,time,latitud,longitud,RRR24_Valor,Traza_Valor,CodigoNacional,nombreEstacion
0,1994-01-01 12:00:00,-18.35555,-70.34028,0.0,0.0,180005.0,"Chacalluta, Arica Ap."
1,1994-01-02 12:00:00,-18.35555,-70.34028,0.0,0.0,180005.0,"Chacalluta, Arica Ap."
2,1994-01-03 12:00:00,-18.35555,-70.34028,0.0,0.0,180005.0,"Chacalluta, Arica Ap."
3,1994-01-04 12:00:00,-18.35555,-70.34028,0.0,0.0,180005.0,"Chacalluta, Arica Ap."
4,1994-01-05 12:00:00,-18.35555,-70.34028,0.0,0.0,180005.0,"Chacalluta, Arica Ap."
...,...,...,...,...,...,...,...
8650,1994-06-26 12:00:00,-62.19194,-58.97972,0.3,0.0,950001.0,"C.M.A. Eduardo Frei Montalva, Antártica"
8651,1994-06-27 12:00:00,-62.19194,-58.97972,0.0,0.0,950001.0,"C.M.A. Eduardo Frei Montalva, Antártica"
8652,1994-06-28 12:00:00,-62.19194,-58.97972,0.0,0.0,950001.0,"C.M.A. Eduardo Frei Montalva, Antártica"
8653,1994-06-29 12:00:00,-62.19194,-58.97972,1.0,0.0,950001.0,"C.M.A. Eduardo Frei Montalva, Antártica"
8654,1994-06-30 12:00:00,-62.19194,-58.97972,0.8,0.0,950001.0,"C.M.A. Eduardo Frei Montalva, Antártica"

We can iterate over dates to capture the year-associated waterfall.

Pandas provides functions to generate [range of dates](https://pandas.pydata.org/docs/reference/api/pandas.date_range.html#pandas-date-range)

In [28]:
start = '1-1-1955'
end   = '1-1-1965'
years_range = pd.date_range(start=start, end=end, freq ='1Y')
years_range

DatetimeIndex(['1955-12-31', '1956-12-31', '1957-12-31', '1958-12-31',
               '1959-12-31', '1960-12-31', '1961-12-31', '1962-12-31',
               '1963-12-31', '1964-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

Now we must push `DataFrame`s into a `list`. This list contains the DataFrames to be concatenated

In [46]:
list_of_dataframes = []
for pos, date in enumerate(years_range):
    df = pd.read_csv(template_url.format(date.year, date.year))
    list_of_dataframes.append(df)

Now we can use the [`pd.concat()`](https://pandas.pydata.org/docs/reference/api/pandas.concat.html#pandas-concat) method that recieve our list of `DataFrame`.

In [47]:
df_concat = pd.concat(list_of_dataframes)

In [48]:
df_concat

,time,latitud,longitud,RRR24_Valor,Traza_Valor,CodigoNacional,nombreEstacion
0,1955-08-11 12:00:00,-45.91833,-71.67778,2.0,0.0,450005.0,Balmaceda Ad.
0,1957-01-02 12:00:00,-34.96944,-71.21694,NaN,NaN,340031.0,"General Freire, Curicó Ad."
1,1957-09-24 12:00:00,-45.91833,-71.67778,3.8,0.0,450005.0,Balmaceda Ad.
2,1957-09-26 12:00:00,-45.91833,-71.67778,0.8,0.0,450005.0,Balmaceda Ad.
3,1957-09-27 12:00:00,-45.91833,-71.67778,7.2,0.0,450005.0,Balmaceda Ad.
...,...,...,...,...,...,...,...
361,1964-12-27 12:00:00,-54.93167,-67.61556,0.0,0.0,550001.0,"Guardiamarina Zañartu, Pto Williams Ad."
362,1964-12-28 12:00:00,-54.93167,-67.61556,0.0,0.0,550001.0,"Guardiamarina Zañartu, Pto Williams Ad."
363,1964-12-29 12:00:00,-54.93167,-67.61556,0.0,0.0,550001.0,"Guardiamarina Zañartu, Pto Williams Ad."
364,1964-12-30 12:00:00,-54.93167,-67.61556,0.0,0.0,550001.0,"Guardiamarina Zañartu, Pto Williams Ad."
365,1964-12-31 12:00:00,-54.93167,-67.61556,0.0,1.0,550001.0,"Guardiamarina Zañartu, Pto Williams Ad."

### Merge

The `merge` method is similar to `join` in SQL. Actually, pandas also implements a `join()` method. However, the `merge` operator is **high performance in-memory**, and it can work on every sql-like `join` operation.

Before showing the implementantion and sintax of the method, we must understand the mechansim of joining `DataFrame`

In [8]:
from utils import display_side_by_side # Just to plot

In any merge/join operation we must have **common columns**,

In [45]:
df_1 = pd.DataFrame({'a':['a1', 'a2'], 'b':['b1', 'b2']})
df_2 = pd.DataFrame({'b':['b1', 'b2', 'b3'], 'c':['c1', 'c2','c3']})

In [46]:
display_side_by_side(df_1,df_2)

,a,b
0,a1,b1
1,a2,b2
,b,c
0,b1,c1
1,b2,c2
2,b3,c3

In [47]:
df_12 = pd.merge(df_1, df_2)

# =================
display_side_by_side(df_1,df_2, df_12)

The `merge` function has different join methods depending on what we need.

By default, `method='inner'` which uses the intersection of the `DataFrames`. However we have another alternativies:

There are many ways to combine 2 dataframes using `pd.merge`.

| Method| Description|
| --- | --- |
| left | Use keys from left frame only|
| right| Use keys from right frame only|
| outer| Use union of keys from both frames|
| inner| Use intersection of keys from both frames|
| cross| Create the cartesian product of rows of both frames

In [50]:
df_l = pd.merge(df_1, df_2, how='left')
df_r = pd.merge(df_1, df_2, how='right')
df_o = pd.merge(df_1, df_2, how='outer')
df_i = pd.merge(df_1, df_2, how='inner')
df_x = pd.merge(df_1, df_2, how='cross')

display_side_by_side(df_l, df_r, df_o, df_i, df_x, titles=['left', 'right', 'outer','inner','cross'])

Pandas also provides a [`join()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html#pandas.DataFrame.join) method which works on indices only

In [59]:
df_1_index = df_1.set_index('b')
df_2_index = df_2.set_index('b')

join_df_1_2 = df_1_index.join(df_2_index)

display_side_by_side(df_1_index, df_2_index, join_df_1_2)

The merge method also do the same

In [66]:
merge_df_1_2 = pd.merge(df_1_index, df_2_index, left_index=True, right_index=True, how='left')

display_side_by_side(df_1_index, df_2_index, merge_df_1_2)

In the next table we can see the comparison between `join()` and `merge()` as function of their capabilities

<img src="images/merge_vs_join.png" width="500"/>

### Split-Apply-Combine

One of the most useful method in Pandas is the `groupby()` function. It allows to split our dataset given the columns values.

In [98]:
df = pd.read_csv('./data/ds_salaries.csv')
df.columns

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In this case we have salaries for jobs related to data science.

In [103]:
df['company_location'].value_counts()

US    355
GB     47
CA     30
DE     28
IN     24
FR     15
ES     14
GR     11
JP      6
NL      4
AT      4
PT      4
PL      4
LU      3
PK      3
BR      3
AE      3
MX      3
AU      3
TR      3
DK      3
IT      2
CZ      2
SI      2
RU      2
CH      2
NG      2
CN      2
BE      2
VN      1
EE      1
AS      1
DZ      1
MY      1
MD      1
KE      1
SG      1
CO      1
IR      1
CL      1
MT      1
IL      1
UA      1
IQ      1
RO      1
HR      1
NZ      1
HU      1
HN      1
IE      1
Name: company_location, dtype: int64

What if we need to see the average salary for each of those countries?

First we need to **separate rows based on its location**. To do that we use the [`groupby()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html#pandas-dataframe-groupby) method

In [105]:
groups = df.groupby('company_location')
groups

This method returns an object that contains all the subframes associated with each location. 

We can iterate over the groups and calculate the average salary per location

In [106]:
for loc, subframe in groups:
    print(subframe)
    break

     Unnamed: 0  work_year experience_level employment_type  \
24           24       2020               MI              FT
480         480       2022               SE              FT
481         481       2022               SE              FT

                     job_title  salary salary_currency  salary_in_usd  \
24         Lead Data Scientist  115000             USD         115000
480  Machine Learning Engineer  120000             USD         120000
481  Machine Learning Engineer   65000             USD          65000

    employee_residence  remote_ratio company_location company_size
24                  AE             0               AE            L
480                 AE           100               AE            S
481                 AE           100               AE            S

However, Pandas allow us to work directly on the set of groups using `apply()`

In [108]:
groups['salary'].apply(lambda x: x.mean())

company_location
AE    1.000000e+05
AS    1.335000e+06
AT    6.400000e+04
AU    1.303333e+05
BE    7.250000e+04
BR    6.520000e+04
CA    1.153067e+05
CH    2.750000e+05
CL    3.040000e+07
CN    1.995000e+05
CO    2.184400e+04
CZ    4.949950e+04
DE    7.128996e+04
DK    1.850000e+05
DZ    1.000000e+05
EE    3.000000e+04
ES    4.738286e+04
FR    5.688133e+04
GB    6.229481e+04
GR    4.736364e+04
HN    2.000000e+04
HR    4.000000e+04
HU    1.100000e+07
IE    6.500000e+04
IL    1.600000e+05
IN    2.065208e+06
IQ    1.000000e+05
IR    4.000000e+03
IT    3.110000e+04
JP    3.408667e+06
KE    9.272000e+03
LU    3.833333e+04
MD    1.800000e+04
MT    2.400000e+04
MX    2.793333e+05
MY    4.000000e+04
NG    3.000000e+04
NL    4.910000e+04
NZ    1.250000e+05
PK    1.333333e+04
PL    1.425000e+05
PT    4.210000e+04
RO    6.000000e+04
RU    1.575000e+05
SG    1.200000e+05
SI    5.400000e+04
TR    1.793333e+05
UA    1.340000e+04
US    1.877160e+05
VN    4.000000e+03
Name: salary, dtype: float64

## Excercise

Answer the following questions

1.- What is the best paid job in data science field?

2.- What is the average salary per job title and location?